In [5]:
import os
import pandas as pd
import numpy as np
import sqlite3
from pprint import pprint

In [2]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [3]:
db = sqlite3.connect(r"C:\sqlite\db\CS513.db")

In [4]:
original_data = pd.read_csv("Data/Food_Inspections.csv")

## Query Checking Restaurant Names

Difference in number of Restaurant Names

In [15]:
query = 'SELECT COUNT(DISTINCT rest_name) AS "Restaurants Names" FROM restaurant'
cursor = db.execute(query)
out = cursor.fetchall()
pprint(out)

[(12332,)]

In [19]:
query = 'SELECT COUNT(DISTINCT "DBA Name") AS "Restaurants Names" FROM original_data'
pysqldf(query)

   Restaurants Names
0              24685

Difference in number of Restaurant Names where the city is Chicago

In [25]:
query = 'SELECT COUNT(DISTINCT rest_name) AS "Restaurants Names" FROM restaurant WHERE city LIKE "%hicago"'
cursor = db.execute(query)
out = cursor.fetchall()
pprint(out)

[(12332,)]

In [26]:
query = 'SELECT COUNT(DISTINCT "DBA Name") AS "Restaurants Names" FROM original_data WHERE City like "%hicago"'
pysqldf(query)

   Restaurants Names
0              24579

## Query Checking Facility Types

In [16]:
query = 'SELECT COUNT(DISTINCT facility_type) AS "Facility Types" FROM restaurant'
cursor = db.execute(query)
out = cursor.fetchall()
pprint(out)

[(113,)]

In [21]:
query = 'SELECT COUNT(DISTINCT "Facility Type") AS "Facility Types" FROM original_data'
pysqldf(query)

   Facility Types
0             447

## Query Checking City

In [22]:
query = 'SELECT COUNT(DISTINCT city) AS "Cities" FROM restaurant'
cursor = db.execute(query)
out = cursor.fetchall()
pprint(out)

[(1,)]

In [23]:
query = 'SELECT COUNT(DISTINCT "City") AS "Cities" FROM original_data'
pysqldf(query)

   Cities
0      57

Shows 57 cities down to just the target: Chicago

In [10]:
original_data.columns

Index(['Inspection ID', 'DBA Name', 'AKA Name', 'License #', 'Facility Type',
       'Risk', 'Address', 'City', 'State', 'Zip', 'Inspection Date',
       'Inspection Type', 'Results', 'Violations', 'Latitude', 'Longitude',
       'Location'],
      dtype='object')

In [28]:
query = 'SELECT COUNT(DISTINCT inspection_id) AS "Inspection ID" FROM inspection'
cursor = db.execute(query)
out = cursor.fetchall()
pprint(out)

[(96063,)]

In [31]:
query = 'SELECT COUNT(DISTINCT "Inspection ID") AS "Inspection ID" FROM original_data WHERE city LIKE "%hicago"'
pysqldf(query)

   Inspection ID
0         153488